nba/app/models/user.rb

INSERT INTO `relationships` (`user_id`, `follow_id`, `created_at`, `updated_at`) VALUES (2, 3, '2020-11-19 07:03:26', '2020-11-19 07:03:26')
SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 2 AND `relationships`.`follow_id` = 3 LIMIT 1
---
  def follow(other_user)
    unless self == other_user
      self.relationships.find_or_create_by(follow_id: other_user.id)

SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 2 AND `relationships`.`follow_id` = 3 LIMIT 1
DELETE FROM `relationships` WHERE `relationships`.`id` = 1
---
  def unfollow(other_user)
    relationship = self.relationships.find_by(follow_id: other_user.id)
    relationship.destroy if relationship

INSERT INTO `favorites` (`user_id`, `chat_id`, `created_at`, `updated_at`) VALUES (3, 2, '2020-11-19 07:59:26', '2020-11-19 07:59:26')
SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 3 AND `favorites`.`chat_id` = 2 LIMIT 1
---
  def favorite(chat)
    self.favorites.find_or_create_by(chat_id: chat.id)

SELECT  `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 3 AND `favorites`.`chat_id` = 2 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 1
---
  def unfavorite(chat)
    favorite = self.favorites.find_by(chat_id: chat.id)
    favorite.destroy if favorite