nba/app/views/chats/create.json.jbuilder

INSERT INTO `chats` (`content`, `user_id`, `team_id`, `created_at`, `updated_at`) VALUES ('test10', 5, 1, '2021-02-03 19:01:04', '2021-02-03 19:01:04')
---
json.team_id chat.team_id
json.created_at chat.created_at