nba/app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by(id: params[:session][:user_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def counts(user)
    @count_chats = user.chats.count
    @count_followings = user.followings.count
    @count_followers = user.followers.count
    @count_favoritings = user.favoritings.count
---
SELECT COUNT(*) FROM `chats` WHERE `chats`.`user_id` = 2
SELECT COUNT(*) FROM `chats` INNER JOIN `favorites` ON `chats`.`id` = `favorites`.`chat_id` WHERE `favorites`.`user_id` = 2