nba/app/controllers/chats_controller.rb

  def index
    @chats = Chat.all.order(team_id: :desc)
---
SELECT `chats`.* FROM `chats` ORDER BY `chats`.`team_id` DESC

  def show
    @chat = Chat.find(params[:id])
---
SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 1 LIMIT 1

  def create
    @chat = current_user.chats.build(chat_params)
    if @chat.save
---
INSERT INTO `chats` (`content`, `user_id`, `team_id`, `created_at`, `updated_at`) VALUES ('test10', 5, 1, '2021-02-03 19:01:04', '2021-02-03 19:01:04')

  def destroy
    @chat.destroy
---
DELETE FROM `chats` WHERE `chats`.`id` = 18

  def correct_user
    @chat = current_user.chats.find_by(id: params[:id])
---
SELECT  `chats`.* FROM `chats` WHERE `chats`.`user_id` = 5 AND `chats`.`id` = 18 LIMIT 1