nba/app/controllers/favorites_controller.rb

SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 2 LIMIT 1
---
  def create
    chat = Chat.find(params[:chat_id])

SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 2 LIMIT 1
---
  def destroy
    chat = Chat.find(params[:chat_id])