nba/app/controllers/teams_controller.rb

SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
---
  def set_team
    @team = Team.find(params[:id])