nba/app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT `teams`.* FROM `teams`

  def create
    @team = Team.new(team_params)
    if @team.save
---
INSERT INTO `teams` (`name`, `conference`, `division`, `founded`, `base`, `arena`, `player1`, `player2`, `player3`, `player4`, `created_at`, `updated_at`) VALUES ('Utah Jazz', 'West', 'NORTHWEST', '1974年', 'ユタ州ソルトレイクシティ', 'Energy Solutions Arena', 'Mike Conley Jr', 'Donovan Mitchell', 'Joe Ingles', 'Bojan Bogdanović', '2021-02-05 22:58:56', '2021-02-05 22:58:56')

  def update
    if @team.update(team_params)
---
UPDATE `teams` SET `player4_img` = 'Bogdanović.jpg', `updated_at` = '2021-02-05 23:05:31' WHERE `teams`.`id` = 3

  def set_team
    @team = Team.find(params[:id])
---
SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 3 LIMIT 1