nba/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('test20', 'test20@gmail.com', '$2a$12$oIGseu/LCCgt22tEwjvOUelNCBV3bf.a0QYz8AuVMKsYY9ptI0Iiq', '2021-02-02 12:08:24', '2021-02-02 12:08:24')

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `name` = 'test20', `updated_at` = '2021-02-02 12:29:59' WHERE `users`.`id` = 5