app/controllers/relationships_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def create
    user = User.find(params[:follow_id])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def destroy
    user = User.find(params[:follow_id])