app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'test1@gmail.com' LIMIT 1
---
  def login(email, password)
    @user = User.find_by(email: email)